# GetRevitElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionsOnSheetUIServiceData..::..GetRevitElementIds Method
RevisionsOnSheetUIServiceData Class See Also
---
return the list of revit Element Ids
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<ElementId> GetRevitElementIds()
```

Visual Basic
---
```text
Public Function GetRevitElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetRevitElementIds()
```

# See Also
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace